def mul(arr):  # ฟังก์ชันที่ใช้ในการคูณทุกค่าในลิสต์ arr ด้วย 2
    for i in range(0, 5):  # การทำงานในลูป for เพื่อคูณทุกค่าในลิสต์
        arr[i] = arr[i] * 2 # ตัวแปรนี้ทำการคูณค่าที่อยู่ในลิสต์ที่ index i ด้วย 2 และเอาผลลัพธ์ไปเก็บในลิสต์เดิม

def main():  # ฟังก์ชันที่ใช้ในการรันโปรแกรม
    base = [3, 7, 2, 4, 5]  # สร้างลิสต์ชื่อ base ที่มีค่าตั้งต้นคือ [3, 7, 2, 4, 5]
    mul(base)  # เรียกใช้ฟังก์ชัน mul โดยส่งลิสต์ base เข้าไป
    print("List now contains:")  # แสดงข้อความ
    for i in range(0, 5):  # ทำงานในลูป for เพื่อแสดงผลลัพธ์ที่ได้หลังจากการคูณทุกค่าในลิสต์ base ด้วย 2
        print("%3d" % base[i])  # แสดงผลลัพธ์ที่ได้หลังจากการทำงานในลูป for
    print("\n")  # แสดงข้อความว่าบรรทัดใหม่

# เริ่มโปรแกรม
main()  # เรียกใช้ฟังก์ชัน main เพื่อเริ่มการทำงานของโปรแกรม
